# IFCExtrusionData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData Class
Members See Also
---
Represents the geometry of an extrusion (a solid body or opening) generated from Revit geometry.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class IFCExtrusionData : IDisposable
```

Visual Basic
---
```text
Public Class IFCExtrusionData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCExtrusionData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCExtrusionData
# See Also
IFCExtrusionData Members
Autodesk.Revit.DB.IFC Namespace